/*
Напишите программу, выводящую "Hello, World!". Можно скопировать ее из конспекта.

Sample Input:

Sample Output:
Hello, World!
*/

#include <iostream>
using namespace std;

int main() {
	cout << "Hello, World!";
	return 0;
}